% ----------我想要一只冰墩墩-------------
%         谢中华（天津科技大学）
% --------------------------------------
%% 一、画北京冬奥会logo
figure('Visible','off','Units','norm','Position',...
    [0.2936,0.4141,0.4100,0.3672])
axes('Position',[0,0,1,1])
axis([0,1,-1,1])
axis ij equal off
set(gcf,'Color','w')
hold on
% 冬字八划的轮廓线坐标
x1 = [0.4985,0.3624,0.3950;
    0.2741,0.3130,0.3428];
x2 = [0.5239,0.4549,0.3950,0.5511;
    0.3078,0.3027,0.3428,0.3390];
x3 = [0.5511,0.4295,0.3878,0.3460,0.2970,0.3606,0.4205,0.5511;
    0.3390,0.3428,0.3649,0.3909,0.4310,0.3986,0.3740,0.3390];
x4 = [0.2970,0.3588,0.4259,0.5221,0.6074,0.6691,0.7018,0.6147,...
    0.5529,0.4894,0.4441,0.4041,0.3479;...
    0.4349,0.4090,0.3844,0.3623,0.3558,0.3571,...
    0.3610,0.3649,0.3740,0.3909,0.3934,0.4012,0.4168];
x5 = [0.7199,0.7018,0.6727,0.5729,0.4894,0.4459,0.415,0.3751,...
    0.3116,0.2589,0.2825,0.3188,0.3733,0.4241,0.4568,0.4949,...
    0.5475,0.631,0.6564,0.6691,0.6963,0.7127;...
    0.3805,0.3921,0.3960,0.3921,0.3909,0.3934,0.3999,0.4103,...
    0.4297,0.4557,0.4778,0.4609,0.4401,0.4272,0.4246,0.4246,...
    0.4297,0.4375,0.4362,0.4362,0.4194,0.3947];
x6 = [0.5584,0.5148,0.4713,0.4114,0.3606,0.3007,0.3442,0.3950,0.4586;
    0.4622,0.4518,0.4479,0.4492,0.4582,0.4765,0.4700,0.4687,0.4738];
x7 = [0.5566,0.4604,0.4132,0.3733,0.4332,0.4676;
    0.4622,0.4738,0.4881,0.5050,0.5322,0.5104];
x8 = [0.5602,0.4350,0.3769,0.4023,0.4350,0.4749,0.5185;
    0.5724,0.5309,0.5063,0.5426,0.5659,0.5879,0.6048];
C = [51 77 151
    180 35 48
    51 77 151
    195 81 44
    73 144 208
    160 196 108
    84 167 209
    51 77 151]/255;
% 以填充式多边形的形式绘制彩色的冬字
for i = 1:8
    eval(['fill(x',num2str(i),'(1,:),x',num2str(i),'(2,:),C(',num2str(i),',:))'])
end
% 奥运五环的圆心坐标
x0 = [0.3388,0.4132,0.4876,0.5620,0.6382;
    0.7925,0.8560,0.7943,0.8578,0.7943]';
r0 = 0.0635;  % 半径
C = [60 124 196
    243 154 50
    15 15 15
    59 168 85
    229 39 85]/255;
% 绘制彩色的奥运五环
for i = 1:5
    viscircles(x0(i,:),r0,'Color',C(i,:));
end
text(0.5,0.65,'BEIJING 2022','FontName','Comic Sans MS',...
    'FontSize',8,'HorizontalAlignment','center'); % 添加文字
F = getframe(gcf);  % 抓取figure窗口内的图像
I = F.cdata;
delete(gcf)

%% 二、画3D熊猫
% -------------------------------%
% 1. 画身体（旋转面）             %
% -------------------------------%
%    身体曲面方程：
%      abs(z) = sart(3)-sqrt(x.^2+y.^2)./(8.314-6.256*sqrt(x.^2+y.^2))
%    母线方程：
%      y = 8.314*(sqrt(3)-abs(z))./(1+6.256*(sqrt(3)-abs(z)))
figure
fun = @(z)8.314*(sqrt(3)-abs(z))./(1+6.256*(sqrt(3)-abs(z)));
z = linspace(-sqrt(3),sqrt(3),101)';
r = fun(z);  % 旋转半径
x = 0*z;
y = x;
theta = linspace(0,2*pi,60); % 旋转角度
x = x+r*cos(theta);  % 旋转面网格点坐标
y = y+r*sin(theta);
z = z*ones(size(theta));
[c,map] = rgb2ind(I,256);
c = double(c)+1;
% 绘制旋转面，并用冬奥会logo图做纹理映射
surf(x,y,z,'EdgeColor','none','Cdata',flipud(c),...
    'FaceColor','texturemap','CDataMapping','direct')
hold on
colormap(map)
axis equal off
view(-106.7461, 5.4000)
set(gcf,'Color','w')

% -------------------------------%
% 2. 画耳朵（旋转的椭球面）        %
% -------------------------------%
%    椭球面方程：
%      (x/5)^2 + (y/2)^2 + (z/3)^2 = 1
%    绕 x 轴旋转角度：±pi/3    旋转后平移量：[0,-0.65,1.4]
[x0,y0,z0] = sphere(200);
xyz = [x0(:),y0(:),z0(:)];
Afun = @(t)[1 0 0;0 cos(t) sin(t);0 -sin(t) cos(t)];
xyz1 = (xyz./[5,2,3])*Afun(-pi/3)+[0,-0.65,1.4];
x = reshape(xyz1(:,1),size(x0));
y = reshape(xyz1(:,2),size(x0));
z = reshape(xyz1(:,3),size(x0));
surf(x,y,z,'EdgeColor','none','FaceColor','k')
surf(x,-y,z,'EdgeColor','none','FaceColor','k')

% -------------------------------%
% 3. 画胳膊（抛物面）             %
% -------------------------------%
%    抛物面方程：
%      z/0.7 = (x/2.7)^2 + (y/2.7)^2
%    绕 x 轴旋转角度：±pi/3    旋转后平移量：[0,1.8,-0.8]
r = linspace(0,1,60)';
x = r*cos(theta);
y = r*sin(theta);
z = x.^2+y.^2;
xyz1 = [x(:),y(:),z(:)]./[2.7,2.7,0.7]*Afun(pi/4)+[0,1.8,-0.8];
x = reshape(xyz1(:,1),size(x));
y = reshape(xyz1(:,2),size(x));
z = reshape(xyz1(:,3),size(x));
surf(x,y,z,'EdgeColor','none','FaceColor','k')
surf(x,-y,-z,'EdgeColor','none','FaceColor','k')

% -------------------------------%
% 4. 画腿（旋转面）               %
% -------------------------------%
%    曲面方程：
%      z = (sqrt(x^2+(y±0.5)^2)/0.34)^3 - 2.3
r = linspace(0,0.34,60)';
x = r*cos(theta);
y = r*sin(theta);
z = (sqrt(x.^2+y.^2)/0.34).^3-2.3;
surf(x,y-0.5,z,'EdgeColor','none','FaceColor','k')
surf(x,0.5-y,z,'EdgeColor','none','FaceColor','k')

% -------------------------------%
% 5. 画面罩线条（两曲面交线）      %
% -------------------------------%
%    两曲面方程：
%      abs(z) = sart(3)-sqrt(x.^2+y.^2)./(8.314-6.256*sqrt(x.^2+y.^2))
%      abs(z) = 8.314*(sqrt(3)-abs(y))/(1+6.256*(sqrt(3)-abs(y)))
y = linspace(-1.01,1.01,60);
zup = fun(1.7*y);
zlo = (0.9-zup)/1.5;
zup = (0.9+zup)/1.5;
z = [zup,zlo(end:-1:1),zup(1)];
y = [y,y(end:-1:1),y(1)];
x = -sqrt(fun(z).^2-y.^2);
plot3(x,y,z,'Color',[0.3,0.9,0.2],'LineWidth',2)
ym = mean(y);
zm = mean(z);
plot3(x-0.1,(y-ym)*0.95+ym,(z-zm)*0.95+zm,'Color',[0.8,0.8,0.2],'LineWidth',2)
plot3(x-0.2,(y-ym)*0.9+ym,(z-zm)*0.9+zm,'Color',[0.8,0.2,0.2],'LineWidth',2)
plot3(x-0.3,(y-ym)*0.85+ym,(z-zm)*0.85+zm,'Color',[0.3,0.3,0.8],'LineWidth',2)

% -------------------------------%
% 6. 画黑眼圈和眼睛（椭球面）      %
% -------------------------------%
%    黑眼圈椭球面：
%      (x/sqrt(5))^2 + (y/sqrt(10/3))^2 + (z/sqrt(6))^2 = 1
%    绕 x 轴旋转角度：±pi/3    旋转后平移量：[-0.7,-0.35,0.72]
%    眼睛椭球面：
%      ((x+1.05)*8.5)^2 + ((y+0.39)*8)^2 + ((z-0.79)*7.5)^2 = 1
xyz1 = (xyz./sqrt([5,10/3,6]))*Afun(pi/3)+[-0.7,-0.35,0.72];
x = reshape(xyz1(:,1),size(x0));
y = reshape(xyz1(:,2),size(x0));
z = reshape(xyz1(:,3),size(x0));
x((y+0.4).^2+(z-0.8).^2 <= 0.02) = NaN;
surf(x,y,z,'FaceColor','k')
surf(x,-y,z,'FaceColor','k')
x2 = x0/8.5-1.05;y2 = y0/8-0.39;z2 = z0/7.5+0.79;
x2((y2+0.4).^2+(z2-0.85).^2 <= 0.001) = NaN;
surf(x2,y2,z2,'EdgeColor','none','FaceColor','k')
surf(x2,-y2,z2,'EdgeColor','none','FaceColor','k')

% -------------------------------%
% 7. 画小手（球面）               %
% -------------------------------%
%    球面方程：x^2 + (y+1.7)^2 + (z±0.7)^2 = 1/25
surf(x0/5,y0/5-1.7,z0/5+0.7,'EdgeColor','none','FaceColor','k');
surf(x0/5,y0/5+1.7,z0/5-0.7,'EdgeColor','none','FaceColor','k');

% -------------------------------%
% 8. 画鼻子（心形面）             %
% -------------------------------%
%    心形面方程：
%      -6*(x+1.1) = sqrt(1-(8*y).^2-(12*(z-0.6)-abs(2*y)).^2)
[y,z] = meshgrid(linspace(-0.5,0.5,100),linspace(-0.6,0.6,100));
x = sqrt(1-(2*y).^2-(2*z-abs(y)).^2);
x = real(x);
x(x<0.01) = NaN;
surf(-x/6-1.1,y/4,z/6+0.6,'EdgeColor','none','FaceColor','k');

% -------------------------------%
% 9. 画手上的红心（心形面）       %
% -------------------------------%
%    把鼻子的心形面进行旋转缩放
xyz1 = [-x(:),y(:),z(:)]./[5,3,3]*Afun(pi/4) + [-0.12,-1.65,0.63];
x = reshape(xyz1(:,1),size(x));
y = reshape(xyz1(:,2),size(x));
z = reshape(xyz1(:,3),size(x));
surf(x,y,z,'EdgeColor','none','FaceColor','r');

% -------------------------------%
% 10. 画小嘴（两条线之间的填充图） %
% -------------------------------%
%    柱面 z = y^2+0.4 和熊猫身体的交线
%    柱面 z = abs(y)^1.6 + 0.49 - 0.3^1.6 和熊猫身体的交线
y = linspace(-0.3,0.3,60);
z1 = y.^2+0.4;
x1 = -sqrt(fun(z1).^2-y.^2);
z2 = abs(y).^1.6 + 0.49-0.3^1.6;
x2 = -sqrt(fun(z2).^2-y.^2);
x = [x1,x2(end:-1:1)]-0.001;
y = [y,y(end:-1:1)];
z = [z1,z2(end:-1:1)];
fill3(x,y,z,'r')

% 11. 设置光源和光照模式
camlight
lighting gouraud

%% 三、制作gif格式动画
% filename = '冰墩墩3.gif';
% f = getframe(gcf);
% IM = frame2im(f);
% [IM,map] = rgb2ind(IM,256);
% imwrite(IM,map,filename,'gif', 'Loopcount',inf,'DelayTime',0.2);
for al = -106.7461:30:(-106.7461+360)
    view(al,5.4);
    pause(0.3);
%     f = getframe(gcf);
%     IM = frame2im(f);
%     [IM,map] = rgb2ind(IM,256);
%     imwrite(IM,map,filename,'gif','WriteMode','append','DelayTime',0.2);
end