model = createpde;                  % 创建微分方程模型
% 创建自定义求解区域
% 3为矩形编号，4是边数，矩形区域顶点x坐标为[0,1,1,0],y坐标为[0,0,1,1]
R1 = [3,4,0,1,1,0,0,0,1,1]'; 
% 1为圆形编号，[0.5,0.5]是圆心坐标，0.1是圆半径
C1 = [1,0.5,0.5,0.1]';
C1 = [C1; zeros(numel(R1)-numel(C1),1)]; % 在C1后面补0，使其与R1等长
geom = [R1,C1];
ns = (char('R1','C1'))';            % 求解区域名称
sf = 'R1-C1';                       % 构造求解区域的公式
g = decsg(geom,sf,ns);              % 创建几何体
geometryFromEdges(model,g);         % 创建自定义求解区域
pdegplot(model,'EdgeLabels','on');  % 绘制求解区域，并显示边界标签 
axis equal;                         % 设置坐标轴的纵横比相同
axis([-0.1,1.1,-0.1,1.1]);          % 设置坐标轴的显示范围
